БИТУправление_медицинским_центром_демо/src/DataProcessors/РедактированиеКонтактнойИнформации/РедактированиеКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РедактированиеКонтактнойИнформации</name>
  <comment>Служит для редактирования контактной информации</comment>
  <attributes>
    <name>Объект</name>
    <comment>Объект</comment>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Клиенты</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Филиалы</types>
      <types>CatalogRef.Сотрудники</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <comment>Тип</comment>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <comment>Вид</comment>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>Представление</name>
    <comment>Представление</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Поле1</name>
    <comment>Поле 1 </comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поле2</name>
    <comment>Поле 2</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поле3</name>
    <comment>Поле 3</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поле4</name>
    <comment>Поле 4</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поле5</name>
    <comment>Поле 5</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поле6</name>
    <comment>Поле 6</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поле7</name>
    <comment>Поле 7</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поле8</name>
    <comment>Поле 8</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поле9</name>
    <comment>Поле 9</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Комментарий</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаписыватьВРегистр</name>
    <comment>Записывать в регистр</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поле10</name>
    <comment>Поле 10</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поле11</name>
    <comment>Поле 11</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поле12</name>
    <comment>Поле 12</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоступностьОбъекта</name>
    <comment>Доступность объекта</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГородскойРайон</name>
    <comment>Городской район проживания</comment>
    <type>
      <types>CatalogRef.Районы</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеПредставление</name>
    <comment>Краткое представление</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДома</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипКорпуса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипКвартиры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВводПоМаске</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/КонтактнаяИнформация/КонтактнаяИнформация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтактнаяИнформация</name>
  <resources>
    <name>ЗначениеПоУмолчанию</name>
    <comment>Признак значения по умолчанию</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <comment>Произвольный комментарий</comment>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Поле1</name>
    <comment>Вспомогательное поле: &quot;Код страны&quot; или &quot;Индекс&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле2</name>
    <comment>Вспомогательное поле: &quot;Код города&quot; или &quot;Регион&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле3</name>
    <comment>Вспомогательное поле: &quot;Номер телефона&quot; или &quot;Район&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле4</name>
    <comment>Вспомогательное поле: &quot;Внутренний (или добавочный)  номер&quot; или &quot;Город&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле5</name>
    <comment>Вспомогательное поле: &quot;Населенный пункт&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле6</name>
    <comment>Вспомогательное поле: &quot;Улица&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле7</name>
    <comment>Вспомогательное поле: &quot;Дом&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле8</name>
    <comment>Вспомогательное поле: &quot;Корпус&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле9</name>
    <comment>Вспомогательное поле: &quot;Квартира&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Представление</name>
    <comment>Строковое представление контактной информации</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле10</name>
    <comment>Вспомогательное поле: &quot;Подъезд&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле11</name>
    <comment>Вспомогательное поле: &quot;Этаж&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле12</name>
    <comment>Вспомогательное поле: &quot;Код двери/домофон&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГородскойРайон</name>
    <comment>Городской район проживания</comment>
    <type>
      <types>CatalogRef.Районы</types>
    </type>
  </resources>
  <resources>
    <name>ТипДома</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипКорпуса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипКвартиры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗначенияПолей</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Значение</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>КраткоеПредставление</name>
    <comment>Краткое представление</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <comment>Объект-владелец контактной информации</comment>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Клиенты</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Филиалы</types>
      <types>CatalogRef.Сотрудники</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тип</name>
    <comment>Тип контактной информации</comment>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вид</name>
    <comment>Вид контактной информации</comment>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/DataProcessors/РедактированиеКонтактнойИнформации/Forms/ФормаЗаписиТелефонаУпр/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЗначенияЗаполнения") 
		И ТипЗнч(Параметры.ЗначенияЗаполнения) = Тип("Структура")
	Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма.Объект, Параметры.ЗначенияЗаполнения);
		Параметры.ЗначенияЗаполнения.Свойство("Редактирование", ЭтаФорма.Редактирование);
	КонецЕсли;	
	
	ПоляКлючаЗаписи = Новый Структура("Объект, Тип, Вид", Объект.Объект, Объект.Тип, Объект.Вид);
	КлючЗаписи = РегистрыСведений.КонтактнаяИнформация.СоздатьКлючЗаписи(ПоляКлючаЗаписи);
	
	// Чтение свойств, не переданных из формы вызова.
	Запись = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, КлючЗаписи);
	Запись.Прочитать();
	
	Редактирование = Запись.Выбран();
	
	Если Редактирование Тогда
		ЗаполнитьЗначенияСвойств(Объект, Запись, , "Объект, Тип, Вид");
	КонецЕсли;
	
	Объект.Тип = Объект.Вид.Тип;
	ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + ?(Объект.Объект = неопределено,""," ["+Объект.Объект.Наименование+"]");

	СписокВидов = КонтактнаяИнформацияСервер.ЗаполнитьСписокВидовКонтактнойИнформации(Объект.Вид);
	Для Каждого Стр Из СписокВидов Цикл
    	Элементы.Вид.СписокВыбора.Добавить(Стр.Значение);
	КонецЦикла;	

	Попытка 
		Элементы.НадписьВладелец.Заголовок = Объект.Объект["НаименованиеПолное"];
	Исключение
		Попытка
			Элементы.НадписьВладелец.Заголовок = Объект.Наименование;
		Исключение
		КонецПопытки;
	КонецПопытки;	
	
	ВводПоМаске = Объект.Вид.ИспользоватьМаскуВвода; // Пересчитывается при открытии.
	ПолеВводПоМаске = Объект.Представление;
	НастроитьВидимостьЭлементовПоВводуПоМаске(Ложь);
	НастроитьДоступностьЭлементов(Не Редактирование);
	
	Если ВводПоМаске Тогда
		ТекущийЭлемент = Элементы.ПолеВводПоМаске;
	Иначе
		ТекущийЭлемент = Элементы.Поле3;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Редактирование
		И ВводПоМаске
		И ЗначениеЗаполнено(Объект.Представление)
		И ПолеВводПоМаске <> Элементы.ПолеВводПоМаске.ТекстРедактирования
	Тогда
		ВводПоМаске = Ложь;
		НастроитьВидимостьЭлементовПоВводуПоМаске(Ложь);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОсновныеДействияФормыДействиеОК(Команда)
	
	ЗаписатьТелефон(Истина);

КонецПроцедуры

&НаКлиенте
Процедура ОсновныеДействияФормыДействиеЗаписать(Команда)
	
	ЗаписатьТелефон();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

Процедура ВидОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ВидНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура Поле1ПриИзменении(Элемент)
	ПереформироватьНомер();
КонецПроцедуры

&НаКлиенте
Процедура Поле2ПриИзменении(Элемент)
	ПереформироватьНомер();
КонецПроцедуры

&НаКлиенте
Процедура Поле3ПриИзменении(Элемент)
	ПереформироватьНомер();
КонецПроцедуры

&НаКлиенте
Процедура Поле4ПриИзменении(Элемент)
	ПереформироватьНомер();
КонецПроцедуры

&НаКлиенте
Процедура ВидПриИзменении(Элемент)
	
	НастроитьДоступностьЭлементов();
	НастроитьВидимостьЭлементовПоВводуПоМаске();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьМаскуВводаПриИзменении(Элемент)
	
	НастроитьВидимостьЭлементовПоВводуПоМаске(Ложь);
	
	Если ВводПоМаске Тогда 
		ПолеВводПоМаске = Объект.Поле3;
		Элементы.ПолеВводПоМаске.ОбновитьТекстРедактирования();
	Иначе
		Объект.Поле3 = ПолеВводПоМаске;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ИспользоватьМаскуВводаПриИзмененииОтложенный", 0.01, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ПолеВводПоМаскеПриИзменении(Элемент)
	ПереформироватьНомер();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаписатьТелефон(Закрыть = Ложь)
	Если ЗаписатьСервер() Тогда
		Модифицированность = Ложь;
		Если Закрыть Тогда
			Закрыть(Истина);
		КонецЕсли;	
		// Оповещение динамических списков контактной информации без основной таблицы об изменении данных.
		Оповестить("КонтактнаяИнформацияИзменение", Объект.Объект);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЗаписатьСервер()
	Об = ДанныеФормыВЗначение(Объект, Тип("ОбработкаОбъект.РедактированиеКонтактнойИнформации"));
	Возврат Об.ЗаписатьСервер(Объект.ЗначениеПоУмолчанию, Редактирование, КлючЗаписи);
КонецФункции	

&НаСервере
Процедура НастроитьДоступностьЭлементов(Создание = Ложь)
	
	Если ЗначениеЗаполнено(Объект.Вид) Тогда 
		ВидИспользоватьМаскуВвода = Объект.Вид.ИспользоватьМаскуВвода;
		Элементы.ИспользоватьМаскуВвода.Доступность	= ВидИспользоватьМаскуВвода;
		Если Создание Тогда 
			ВводПоМаске = ВидИспользоватьМаскуВвода;
		КонецЕсли;		
	Иначе 	
		Элементы.ИспользоватьМаскуВвода.Доступность	= Ложь;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьЭлементовПоВводуПоМаске(ОбновитьЗначениеВводПоМаске = Истина)
	
	ВидИспользоватьМаскуВвода = Объект.Вид.ИспользоватьМаскуВвода;
	Если ОбновитьЗначениеВводПоМаске Тогда
		ВводПоМаске = ВидИспользоватьМаскуВвода;
	КонецЕсли;
	
	Элементы.Поле1.Видимость				  = Не ВводПоМаске;
	Элементы.Поле2.Видимость				  = Не ВводПоМаске;
	Элементы.Поле3.Видимость				  = Не ВводПоМаске;
	Элементы.Поле4.Видимость				  = Не ВводПоМаске;
	Элементы.ПолеВводПоМаске.Видимость		  = ВводПоМаске;
	Если ВводПоМаске Тогда
		Элементы.ПолеВводПоМаске.Маска = Объект.Вид.МаскаВводаТелефонногоНомера;
	КонецЕсли;
	
	Элементы.Поле4.ПоложениеЗаголовка = ?(ВводПоМаске, ПоложениеЗаголовкаЭлементаФормы.Лево, ПоложениеЗаголовкаЭлементаФормы.Верх);
	
	Элементы.ИспользоватьМаскуВвода.Видимость = ВидИспользоватьМаскуВвода;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьМаскуВводаПриИзмененииОтложенный()
	
	Если ВводПоМаске Тогда 
		ПолеВводПоМаске = Элементы.ПолеВводПоМаске.ТекстРедактирования;
		ПереформироватьНомер();	
 	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереформироватьНомер()
	
	Если ВводПоМаске Тогда 
		Объект.Представление = ?((Не ПустаяСтрока(ПолеВводПоМаске)),ПолеВводПоМаске,"");
	    Объект.Поле3 = СМС_ФормированиеСообщений.НормализоватьСотовыйТелефон(ПолеВводПоМаске);
	Иначе  
		Объект.Представление = Объект.Поле1;
		Объект.Представление = Объект.Представление + ?((Не ПустаяСтрока(Объект.Поле2)),(ПроверкаПустойСтроки(Объект.Представление, Ложь)+"(" + Объект.Поле2 + ")"),"");
		Объект.Представление = Объект.Представление + ?((Не ПустаяСтрока(Объект.Поле3)),(ПроверкаПустойСтроки(Объект.Представление, ПустаяСтрока(Объект.Поле2)) + Объект.Поле3),"");
	КонецЕсли;
	
	Если Не ПустаяСтрока(Объект.Представление) Тогда
		Объект.Представление = Объект.Представление + ?((Не ПустаяСтрока(Объект.Поле4)),(ПроверкаПустойСтроки(Объект.Представление) + "доб. " + Объект.Поле4),"");
	Иначе
		Объект.Представление = Объект.Поле4;
	КонецЕсли; 
		
КонецПроцедуры

// Функция проверяет строку на наличие значимых символов.
//
// Параметры:
//  ВыбСтрока		 - Строка	 - строка для проверки.
//  ПризнакЗапятой	 - Булево	 - нужна ли запятая
// 
// Возвращаемое значение:
//  Строка - пробел или пустое значение строки.
//
&НаКлиентеНаСервереБезКонтекста
Функция ПроверкаПустойСтроки(ВыбСтрока, ПризнакЗапятой=Истина)
	
	Если ПустаяСтрока(ВыбСтрока) Тогда
		Возврат "";
	Иначе
		Возврат ?(ПризнакЗапятой,",","")+" ";
	КонецЕсли; 
	
КонецФункции 

#КонецОбласти
